Revit 2027 API
DuctSizes Methods
The DuctSizes type exposes the following members.
Methods
Name | Description
Contains |  Checks whether a duct size with the nominal diameter exists.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetDuctSizeIterator | Returns a DuctSizeIterator that iterates through the collection.
GetEnumerator | Returns an enumerator that iterates through a collection.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
DuctSizes Class
Autodesk.Revit.DB.Mechanical Namespace